{"id":"b5c1a4d9-7741-426a-a16a-efeea7bacad5","revision":0,"last_node_id":35,"last_link_id":38,"nodes":[{"id":12,"type":"SetNode","pos":[246.3406311251387,-175.16485983832135],"size":[210,60],"flags":{"collapsed":true},"order":17,"mode":0,"inputs":[{"name":"IMAGE","type":"IMAGE","link":9}],"outputs":[{"name":"*","type":"*","links":null}],"title":"Set_Original_Vid","properties":{"previousName":"Original_Vid"},"widgets_values":["Original_Vid"],"color":"#2a363b","bgcolor":"#3f5159"},{"id":16,"type":"SetNode","pos":[279.9386710916556,-217.3619210041283],"size":[210,60],"flags":{"collapsed":true},"order":18,"mode":0,"inputs":[{"name":"AUDIO","type":"AUDIO","link":16}],"outputs":[{"name":"*","type":"*","links":null}],"title":"Set_Audio","properties":{"previousName":"Audio"},"widgets_values":["Audio"]},{"id":2,"type":"TemporalFlowAverage","pos":[466.50853053220976,-166.01995384146144],"size":[330,310],"flags":{},"order":13,"mode":0,"inputs":[{"localized_name":"images","name":"images","type":"IMAGE","link":10},{"localized_name":"window_size","name":"window_size","type":"INT","widget":{"name":"window_size"},"link":null},{"localized_name":"weight_decay","name":"weight_decay","type":"FLOAT","widget":{"name":"weight_decay"},"link":null},{"localized_name":"flow_model","name":"flow_model","type":"COMBO","widget":{"name":"flow_model"},"link":null},{"localized_name":"flow_iterations","name":"flow_iterations","type":"INT","widget":{"name":"flow_iterations"},"link":null},{"localized_name":"color_threshold","name":"color_threshold","type":"FLOAT","widget":{"name":"color_threshold"},"link":null},{"localized_name":"scene_threshold","name":"scene_threshold","type":"FLOAT","widget":{"name":"scene_threshold"},"link":null},{"localized_name":"batch_size","name":"batch_size","type":"INT","widget":{"name":"batch_size"},"link":null}],"outputs":[{"localized_name":"clean","name":"clean","type":"IMAGE","slot_index":0,"links":[3,5]},{"localized_name":"weight_map","name":"weight_map","type":"IMAGE","slot_index":1,"links":null}],"properties":{"aux_id":"khwhite0413/ComfyUI-FlowDenoise","ver":"33855217795a7b2f61a16bada93cf030da6ff169","Node name for S&R":"TemporalFlowAverage"},"widgets_values":[3,0.8,"memfof",8,0.04,0.05,24],"color":"#233","bgcolor":"#355"},{"id":21,"type":"SetNode","pos":[1053.6451510705338,84.61615077305179],"size":[210,60],"flags":{"collapsed":true},"order":22,"mode":0,"inputs":[{"name":"IMAGE","type":"IMAGE","link":21}],"outputs":[{"name":"*","type":"*","links":null}],"title":"Set_Noise_total","properties":{"previousName":"Noise_total"},"widgets_values":["Noise_total"],"color":"#2a363b","bgcolor":"#3f5159"},{"id":22,"type":"SetNode","pos":[1035.6397082822868,123.47033118765916],"size":[210,58],"flags":{"collapsed":true},"order":23,"mode":0,"inputs":[{"name":"IMAGE","type":"IMAGE","link":22}],"outputs":[{"name":"*","type":"*","links":null}],"title":"Set_Noise_chroma","properties":{"previousName":"Noise_chroma"},"widgets_values":["Noise_chroma"],"color":"#2a363b","bgcolor":"#3f5159"},{"id":23,"type":"SetNode","pos":[1051.1060409837387,162.3841225729453],"size":[210,58],"flags":{"collapsed":true},"order":24,"mode":0,"inputs":[{"name":"IMAGE","type":"IMAGE","link":23}],"outputs":[{"name":"*","type":"*","links":null}],"title":"Set_Noise_luma","properties":{"previousName":"Noise_luma"},"widgets_values":["Noise_luma"],"color":"#2a363b","bgcolor":"#3f5159"},{"id":9,"type":"MarkdownNote","pos":[902.7777412350667,204.05995248473724],"size":[300,140],"flags":{},"order":0,"mode":0,"inputs":[],"outputs":[],"title":"Extract Noise Preview","properties":{},"widgets_values":["## Extract Noise\nVisualization only (does not affect denoising)\n\n- **heatmap**: Noise magnitude as turbo colormap\n- **signed**: Positive (red) / negative (blue) direction\n- **gray**: Classic grayscale visualization"],"color":"#233","bgcolor":"#355"},{"id":3,"type":"ExtractNoise","pos":[905.8624567458743,-174.033053515725],"size":[300,220],"flags":{},"order":19,"mode":0,"inputs":[{"localized_name":"original","name":"original","type":"IMAGE","link":15},{"localized_name":"clean","name":"clean","type":"IMAGE","link":3},{"localized_name":"noise_amplify","name":"noise_amplify","type":"FLOAT","widget":{"name":"noise_amplify"},"link":null},{"localized_name":"color_space","name":"color_space","type":"COMBO","widget":{"name":"color_space"},"link":null},{"localized_name":"noise_preview","name":"noise_preview","type":"COMBO","widget":{"name":"noise_preview"},"link":null}],"outputs":[{"localized_name":"noise_total","name":"noise_total","type":"IMAGE","slot_index":0,"links":[21]},{"localized_name":"noise_chroma","name":"noise_chroma","type":"IMAGE","slot_index":1,"links":[22]},{"localized_name":"noise_luma","name":"noise_luma","type":"IMAGE","slot_index":2,"links":[23]}],"properties":{"aux_id":"khwhite0413/ComfyUI-FlowDenoise","ver":"33855217795a7b2f61a16bada93cf030da6ff169","Node name for S&R":"ExtractNoise"},"widgets_values":[1,"YCbCr","heatmap"],"color":"#233","bgcolor":"#355"},{"id":13,"type":"GetNode","pos":[638.24863885202,184.6361099248231],"size":[210,60],"flags":{"collapsed":true},"order":1,"mode":0,"inputs":[],"outputs":[{"name":"IMAGE","type":"IMAGE","links":[10,14,15]}],"title":"Get_Original_Vid","properties":{},"widgets_values":["Original_Vid"],"color":"#2a363b","bgcolor":"#3f5159"},{"id":26,"type":"GetNode","pos":[1743.8221164278743,434.11311022288504],"size":[210,60],"flags":{"collapsed":true},"order":2,"mode":0,"inputs":[],"outputs":[{"name":"IMAGE","type":"IMAGE","links":[26]}],"title":"Get_Final_Output","properties":{},"widgets_values":["Final_Output"],"color":"#2a363b","bgcolor":"#3f5159"},{"id":28,"type":"GetNode","pos":[901.471840701402,392.694278466466],"size":[210,50],"flags":{"collapsed":true},"order":3,"mode":0,"inputs":[],"outputs":[{"name":"IMAGE","type":"IMAGE","links":[28]}],"title":"Get_Noise_total","properties":{},"widgets_values":["Noise_total"],"color":"#2a363b","bgcolor":"#3f5159"},{"id":29,"type":"GetNode","pos":[901.9971869370062,430.4844176985335],"size":[210,50],"flags":{"collapsed":true},"order":4,"mode":0,"inputs":[],"outputs":[{"name":"IMAGE","type":"IMAGE","links":[29]}],"title":"Get_Noise_chroma","properties":{},"widgets_values":["Noise_chroma"],"color":"#2a363b","bgcolor":"#3f5159"},{"id":27,"type":"GetNode","pos":[902.776834728787,467.829590846877],"size":[210,60.47040929702587],"flags":{"collapsed":true},"order":5,"mode":0,"inputs":[],"outputs":[{"name":"IMAGE","type":"IMAGE","links":[30]}],"title":"Get_Noise_luma","properties":{},"widgets_values":["Noise_luma"],"color":"#2a363b","bgcolor":"#3f5159"},{"id":20,"type":"ImageConcatMulti","pos":[903.7613404699457,512.5205529614924],"size":[270,190],"flags":{},"order":14,"mode":0,"inputs":[{"localized_name":"image_1","name":"image_1","type":"IMAGE","link":28},{"localized_name":"image_2","name":"image_2","shape":7,"type":"IMAGE","link":29},{"localized_name":"inputcount","name":"inputcount","type":"INT","widget":{"name":"inputcount"},"link":null},{"localized_name":"direction","name":"direction","type":"COMBO","widget":{"name":"direction"},"link":null},{"localized_name":"match_image_size","name":"match_image_size","type":"BOOLEAN","widget":{"name":"match_image_size"},"link":null},{"name":"image_3","shape":7,"type":"IMAGE","link":30}],"outputs":[{"localized_name":"images","name":"images","type":"IMAGE","links":[31]}],"properties":{"cnr_id":"comfyui-kjnodes","ver":"468fcc86f0b29e79a8510e8239eb15714d6747a6"},"widgets_values":[3,"right",true,null]},{"id":31,"type":"SetNode","pos":[1005.0493851352431,742.8574166128701],"size":[210,60],"flags":{"collapsed":true},"order":21,"mode":0,"inputs":[{"name":"IMAGE","type":"IMAGE","link":31}],"outputs":[{"name":"*","type":"*","links":null}],"title":"Set_Extract_Noise","properties":{"previousName":"Extract_Noise"},"widgets_values":["Extract_Noise"],"color":"#2a363b","bgcolor":"#3f5159"},{"id":24,"type":"GetNode","pos":[1744.753058882447,393.06030105724113],"size":[210,60],"flags":{"collapsed":true},"order":6,"mode":0,"inputs":[],"outputs":[{"name":"AUDIO","type":"AUDIO","links":[24]}],"title":"Get_Audio","properties":{},"widgets_values":["Audio"]},{"id":34,"type":"GetNode","pos":[1734.6043812343041,-305.48828448812475],"size":[210,34],"flags":{"collapsed":true},"order":7,"mode":0,"inputs":[],"outputs":[{"name":"AUDIO","type":"AUDIO","links":[33]}],"title":"Get_Audio","properties":{},"widgets_values":["Audio"]},{"id":32,"type":"GetNode","pos":[1731.4457615129354,-264.0907127580089],"size":[210,60],"flags":{"collapsed":true},"order":8,"mode":0,"inputs":[],"outputs":[{"name":"IMAGE","type":"IMAGE","links":[32]}],"title":"Get_Extract_Noise","properties":{},"widgets_values":["Extract_Noise"],"color":"#2a363b","bgcolor":"#3f5159"},{"id":7,"type":"MarkdownNote","pos":[477.6936453775452,224.0226829062284],"size":[331.2230555590784,481.94288784908906],"flags":{},"order":9,"mode":0,"inputs":[],"outputs":[],"title":"Temporal Flow Average Parameter Guide","properties":{},"widgets_values":["## Temporal Flow Average\n\n| Parameter | Description |\n|---------|------|\n| `window_size` | Frames to average per side (2 = 5 total) |\n| `weight_decay` | Temporal weight decay (lower = stronger averaging) |\n| `flow_model` | memfof / raft_small / raft_large |\n| `flow_iterations` | Flow refinement iters (memfof: 8, raft: 20) |\n| `color_threshold` | Per-pixel color diff threshold (anti-ghosting) |\n| `scene_threshold` | Scene change threshold (lower = more sensitive) |\n| `batch_size` | MEMFOF batch size (higher = faster, more VRAM) |\n\n### Recommended Settings\n- **AI video** (Seedance, Kling, etc.)\n  - window: `2-3`, decay: `0.7`\n- **Live action** (film grain)\n  - window: `3-5`, decay: `0.6`\n- **Fast motion**\n  - window: `1-2`, decay: `0.9`\n- **scene_threshold**: 0.03~0.06 (too low may skip denoising)\n- **batch_size**: `24` recommended for RTX 5090 32GB at 720p"],"color":"#233","bgcolor":"#355"},{"id":6,"type":"MarkdownNote","pos":[447.34811476140266,-639.1489053791546],"size":[602.5426908042479,332.1481682197011],"flags":{},"order":10,"mode":0,"inputs":[],"outputs":[],"title":"Flow Denoise Workflow","properties":{},"widgets_values":["# Flow Denoise\nOptical flow-based temporal video denoising\n\n## Pipeline\n1. **LoadVideo** — Load video\n2. **Temporal Flow Average** — Align neighboring frames via MEMFOF flow and average\n3. **Extract Noise** — Visualize removed noise (optional)\n4. **Selective Denoise** — Independent chroma/luma blending\n5. **VideoCombine** — Save result\n\n## Dependencies\n- `pip install memfof`\n- VHS (Video Helper Suite)\n\n> MEMFOF model is automatically downloaded from HuggingFace on first run."],"color":"#233","bgcolor":"#355"},{"id":4,"type":"SelectiveDenoise","pos":[1315.5198816344193,-175.36005513334132],"size":[330,250],"flags":{},"order":20,"mode":0,"inputs":[{"localized_name":"original","name":"original","type":"IMAGE","link":14},{"localized_name":"clean","name":"clean","type":"IMAGE","link":5},{"localized_name":"chroma_strength","name":"chroma_strength","type":"FLOAT","widget":{"name":"chroma_strength"},"link":null},{"localized_name":"luma_strength","name":"luma_strength","type":"FLOAT","widget":{"name":"luma_strength"},"link":null},{"localized_name":"color_space","name":"color_space","type":"COMBO","widget":{"name":"color_space"},"link":null},{"localized_name":"clamp_output","name":"clamp_output","type":"BOOLEAN","widget":{"name":"clamp_output"},"link":null}],"outputs":[{"localized_name":"denoised","name":"denoised","type":"IMAGE","slot_index":0,"links":[38]}],"properties":{"aux_id":"khwhite0413/ComfyUI-FlowDenoise","ver":"33855217795a7b2f61a16bada93cf030da6ff169","Node name for S&R":"SelectiveDenoise"},"widgets_values":[1,1,"YCbCr",true],"color":"#233","bgcolor":"#355"},{"id":8,"type":"MarkdownNote","pos":[1312.2174045103066,157.57716947521564],"size":[330.5083460809369,361.99464310420717],"flags":{},"order":11,"mode":0,"inputs":[],"outputs":[],"title":"Selective Denoise Parameter Guide","properties":{},"widgets_values":["## Selective Denoise\nIndependent per-channel blending of original and clean in color space\n\n| Parameter | Description |\n|---------|------|\n| `chroma_strength` | Chroma denoising strength (0~1) |\n| `luma_strength` | Luma denoising strength (0~1) |\n| `color_space` | YCbCr / HSV / LAB |\n| `clamp_output` | Clamp output to [0,1] |\n\n### Tips\n- **Chroma flicker only**: chroma `1.0`, luma `0.0`\n- **Full denoise**: chroma `1.0`, luma `1.0`\n- **Preserve luma recommended**: AI video has little brightness variation, keep luma low\n- Setting both to 1.0 gives the same result as the Temporal Flow Average clean output. Adjust based on how much detail smearing is acceptable"],"color":"#233","bgcolor":"#355"},{"id":25,"type":"SetNode","pos":[1478.3503024549827,114.82521352438343],"size":[210,60],"flags":{"collapsed":true},"order":25,"mode":0,"inputs":[{"name":"IMAGE","type":"IMAGE","link":38}],"outputs":[{"name":"*","type":"*","links":null}],"title":"Set_Final_Output","properties":{"previousName":"Final_Output"},"widgets_values":["Final_Output"],"color":"#2a363b","bgcolor":"#3f5159"},{"id":33,"type":"VHS_VideoCombine","pos":[1732.467177368866,-218.06281520864633],"size":[566.6578248996261,334],"flags":{},"order":16,"mode":0,"inputs":[{"localized_name":"images","name":"images","type":"IMAGE","link":32},{"localized_name":"audio","name":"audio","shape":7,"type":"AUDIO","link":33},{"localized_name":"meta_batch","name":"meta_batch","shape":7,"type":"VHS_BatchManager","link":null},{"localized_name":"vae","name":"vae","shape":7,"type":"VAE","link":null},{"localized_name":"frame_rate","name":"frame_rate","type":"FLOAT","widget":{"name":"frame_rate"},"link":null},{"localized_name":"loop_count","name":"loop_count","type":"INT","widget":{"name":"loop_count"},"link":null},{"localized_name":"filename_prefix","name":"filename_prefix","type":"STRING","widget":{"name":"filename_prefix"},"link":null},{"localized_name":"format","name":"format","type":"COMBO","widget":{"name":"format"},"link":null},{"localized_name":"pingpong","name":"pingpong","type":"BOOLEAN","widget":{"name":"pingpong"},"link":null},{"localized_name":"save_output","name":"save_output","type":"BOOLEAN","widget":{"name":"save_output"},"link":null},{"name":"pix_fmt","type":["yuv420p","yuv420p10le"],"widget":{"name":"pix_fmt"},"link":null},{"name":"crf","type":"INT","widget":{"name":"crf"},"link":null},{"name":"save_metadata","type":"BOOLEAN","widget":{"name":"save_metadata"},"link":null},{"name":"trim_to_audio","type":"BOOLEAN","widget":{"name":"trim_to_audio"},"link":null}],"outputs":[{"localized_name":"Filenames","name":"Filenames","type":"VHS_FILENAMES","slot_index":0,"links":null}],"title":"Extract_Noise","properties":{"cnr_id":"comfyui-videohelpersuite","ver":"1.7.9","Node name for S&R":"VHS_VideoCombine"},"widgets_values":{"frame_rate":24,"loop_count":0,"filename_prefix":"FlowDenoise","format":"video/h264-mp4","pix_fmt":"yuv420p","crf":12,"save_metadata":true,"trim_to_audio":false,"pingpong":false,"save_output":true,"videopreview":{"hidden":false,"paused":false,"params":{}}},"color":"#233","bgcolor":"#355"},{"id":5,"type":"VHS_VideoCombine","pos":[1742.5927535769665,482.00760284394306],"size":[566.6578248996261,334],"flags":{},"order":15,"mode":0,"inputs":[{"localized_name":"images","name":"images","type":"IMAGE","link":26},{"localized_name":"audio","name":"audio","shape":7,"type":"AUDIO","link":24},{"localized_name":"meta_batch","name":"meta_batch","shape":7,"type":"VHS_BatchManager","link":null},{"localized_name":"vae","name":"vae","shape":7,"type":"VAE","link":null},{"localized_name":"frame_rate","name":"frame_rate","type":"FLOAT","widget":{"name":"frame_rate"},"link":null},{"localized_name":"loop_count","name":"loop_count","type":"INT","widget":{"name":"loop_count"},"link":null},{"localized_name":"filename_prefix","name":"filename_prefix","type":"STRING","widget":{"name":"filename_prefix"},"link":null},{"localized_name":"format","name":"format","type":"COMBO","widget":{"name":"format"},"link":null},{"localized_name":"pingpong","name":"pingpong","type":"BOOLEAN","widget":{"name":"pingpong"},"link":null},{"localized_name":"save_output","name":"save_output","type":"BOOLEAN","widget":{"name":"save_output"},"link":null},{"name":"pix_fmt","type":["yuv420p","yuv420p10le"],"widget":{"name":"pix_fmt"},"link":null},{"name":"crf","type":"INT","widget":{"name":"crf"},"link":null},{"name":"save_metadata","type":"BOOLEAN","widget":{"name":"save_metadata"},"link":null},{"name":"trim_to_audio","type":"BOOLEAN","widget":{"name":"trim_to_audio"},"link":null}],"outputs":[{"localized_name":"Filenames","name":"Filenames","type":"VHS_FILENAMES","slot_index":0,"links":null}],"title":"Final_Output","properties":{"cnr_id":"comfyui-videohelpersuite","ver":"1.7.9","Node name for S&R":"VHS_VideoCombine"},"widgets_values":{"frame_rate":24,"loop_count":0,"filename_prefix":"FlowDenoise","format":"video/h264-mp4","pix_fmt":"yuv420p","crf":12,"save_metadata":true,"trim_to_audio":false,"pingpong":false,"save_output":true,"videopreview":{"hidden":false,"paused":false,"params":{}}},"color":"#233","bgcolor":"#355"},{"id":1,"type":"VHS_LoadVideo","pos":[-209.1251972813515,-118.49009034881574],"size":[607.8842435015655,655.0716529193027],"flags":{},"order":12,"mode":0,"inputs":[{"localized_name":"meta_batch","name":"meta_batch","shape":7,"type":"VHS_BatchManager","link":null},{"localized_name":"vae","name":"vae","shape":7,"type":"VAE","link":null},{"localized_name":"video","name":"video","type":"COMBO","widget":{"name":"video"},"link":null},{"localized_name":"force_rate","name":"force_rate","type":"FLOAT","widget":{"name":"force_rate"},"link":null},{"localized_name":"custom_width","name":"custom_width","type":"INT","widget":{"name":"custom_width"},"link":null},{"localized_name":"custom_height","name":"custom_height","type":"INT","widget":{"name":"custom_height"},"link":null},{"localized_name":"frame_load_cap","name":"frame_load_cap","type":"INT","widget":{"name":"frame_load_cap"},"link":null},{"localized_name":"skip_first_frames","name":"skip_first_frames","type":"INT","widget":{"name":"skip_first_frames"},"link":null},{"localized_name":"select_every_nth","name":"select_every_nth","type":"INT","widget":{"name":"select_every_nth"},"link":null},{"localized_name":"format","name":"format","shape":7,"type":"COMBO","widget":{"name":"format"},"link":null}],"outputs":[{"localized_name":"IMAGE","name":"IMAGE","type":"IMAGE","slot_index":0,"links":[9]},{"localized_name":"frame_count","name":"frame_count","type":"INT","slot_index":1,"links":null},{"localized_name":"audio","name":"audio","type":"AUDIO","slot_index":2,"links":[16]},{"localized_name":"video_info","name":"video_info","type":"VHS_VIDEOINFO","slot_index":3,"links":null}],"title":"Input_Video","properties":{"cnr_id":"comfyui-videohelpersuite","ver":"1.7.9","Node name for S&R":"VHS_LoadVideo"},"widgets_values":{"video":"","force_rate":0,"custom_width":0,"custom_height":0,"frame_load_cap":0,"skip_first_frames":0,"select_every_nth":1,"format":"AnimateDiff","videopreview":{"hidden":false,"paused":false,"params":{"frame_load_cap":0}}}}],"links":[[3,2,0,3,1,"IMAGE"],[5,2,0,4,1,"IMAGE"],[9,1,0,12,0,"IMAGE"],[10,13,0,2,0,"IMAGE"],[14,13,0,4,0,"IMAGE"],[15,13,0,3,0,"IMAGE"],[16,1,2,16,0,"AUDIO"],[21,3,0,21,0,"IMAGE"],[22,3,1,22,0,"IMAGE"],[23,3,2,23,0,"IMAGE"],[24,24,0,5,1,"AUDIO"],[26,26,0,5,0,"IMAGE"],[28,28,0,20,0,"IMAGE"],[29,29,0,20,1,"IMAGE"],[30,27,0,20,5,"IMAGE"],[31,20,0,31,0,"IMAGE"],[32,32,0,33,0,"IMAGE"],[33,34,0,33,1,"AUDIO"],[38,4,0,25,0,"IMAGE"]],"groups":[{"id":1,"title":"Processing","bounding":[427.074882507325,-252.24999999999514,1276.6569902640313,1023.3450631978137],"color":"#3f789e","font_size":24,"flags":{}}],"config":{},"extra":{"ds":{"scale":1.064800000000024,"offset":[986.1861471910372,545.3629409544585]},"workflowRendererVersion":"LG"},"version":0.4}